app/controllers/accounts_controller.rb

  def index
    @user = current_user
    respond_with @user.accounts.all
---
SELECT "accounts".* FROM "accounts" WHERE "accounts"."user_id" = ?  [["user_id", 3]]

  def show
    respond_with Account.find(params[:id])
---
SELECT  "accounts".* FROM "accounts" WHERE "accounts"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]

  def create
    respond_with current_user.accounts.create(account_params)
---
INSERT INTO "accounts" ("name", "balance", "user_id", "created_at", "updated_at", "currency_id") VALUES (?, ?, ?, ?, ?, ?)  [["name", "phehehehe"], ["balance", 48489.0], ["user_id", 2], ["created_at", "2017-07-31 16:54:32.858507"], ["updated_at", "2017-07-31 16:54:32.858507"], ["currency_id", 827]]

  def update
    respond_with Account.find(params[:id]).update(balance_param)
---
SELECT  "accounts".* FROM "accounts" WHERE "accounts"."id" = ? LIMIT ?  [["id", 73], ["LIMIT", 1]]
UPDATE "accounts" SET "balance" = ?, "updated_at" = ? WHERE "accounts"."id" = ?  [["balance", -3865.0], ["updated_at", "2017-08-05 08:49:27.140277"], ["id", 73]]