app/controllers/currencies_controller.rb

SELECT  "currencies".* FROM "currencies" WHERE "currencies"."currency" = ? LIMIT ?  [["currency", 73], ["LIMIT", 1]]
---
  def index
    respond_with Currency.all