app/controllers/transactions_controller.rb

SELECT "transactions".* FROM "transactions" WHERE "transactions"."user_id" = ?  [["user_id", 2]]
---
  def index
    @user = current_user
    respond_with @user.transactions.all

INSERT INTO "transactions" ("ammount", "description", "made_on_date", "currency", "account_id", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    respond_with current_user.transactions.create(transaction_params)